#+TITLE: 进程控制
#+AUTHOR: DarkSun
#+CATEGORY: Programming, AUPE
#+DATE: [2015-05-18 周一 21:29]
#+OPTIONS: ^:{}
** 当exec调用一个带`#! 解析器程序 可选参数项'的脚本文件时:
1. exec实际执行的并不是该脚本文件,而是脚本文件第一行`#! 解析器程序 可选参数项'中的 *解析器程序*
2. exec传递给该解析器程序的参数顺序为,解析器地址,可选参数,脚本文件地址,除argv0外的由exec函数传入的其他参数.
   #+BEGIN_SRC C
     /*
       /tmp/testinterp的内容为:
       #! /usr/bin/echo.exe args:
     ,*/

     #include <unistd.h>

     int main()
     {
       execl("/tmp/testinterp","testinterp","myarg1","MY ARG2",(char*) 0);
     }
   #+END_SRC

   #+RESULTS:
   : args: /tmp/testinterp myarg1 MY ARG2
